app/views/tweets/index.html.erb


  <% if Current.user.twitter_accounts.any? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]


<% if Current.user.twitter_accounts.none? %>
---
SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]