app/controllers/tweets_controller.rb

  def create
    @tweet = Current.user.tweets.new(tweet_params)
    if @tweet.save
---
INSERT INTO "tweets" ("user_id", "twitter_account_id", "body", "published_at", "tweet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "body" = $1, "updated_at" = $2 WHERE "tweets"."id" = $3  [["body", "testing1"], ["updated_at", "2022-07-03 13:35:46.337132"], ["id", 1]]

  def set_tweet
    @tweet = Current.user.tweets.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 AND "tweets"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 2], ["LIMIT", 1]]