app/controllers/twitter_accounts_controller.rb

SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1  [["user_id", 7]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def set_twitter_account
    @twitter_account = Current.user.twitter_account.find(params[:id])